export const navLinks = [
  {
    label: "Cyber Security",
    route: "/",
    id: 1,
  },
  {
    label: "STEPS",
    route: "/steps",
    id: 2,
  },
  {
    label: "Hash Text",
    route: "/hash",
    id: 3,
  },
  {
    label: "Password",
    route: "/password",
    id: 4,
  },
];

  export const tipsData = [
    {
      label: "Вы — мишень для хакеров",
      path: "target.png",
        text: 
        "Никогда не говорите:«Со мной этого не случится».      Мы все находимся в зоне риска, и ставки высоки – как для вашего личного и финансового благополучия.>           Кибербезопасность – это ответственность каждого .           Следуя приведенным ниже советам и сохраняя бдительность,        вы вносите свой вклад в защиту себя и других."
    },
    {
      label: "Постоянно обновляйте программное обеспечение.",
      path: "OS.png",
      text: "Установка обновлений программного обеспечения для вашей операционной системы и программ имеет решающее значение. Всегда устанавливайте последние обновления безопасности для своих устройств: Включите автоматическое обновление для вашей операционной системы.  Используйте веб-браузеры, такие как Chrome или Firefox, которые получают частые автоматические обновления безопасности. Обязательно обновляйте плагины браузера (Flash, Java и т. д.)."
    },
    {
      label: "Фишинг: остерегайтесь опасных электронных писем ",
      path: "pishing.png",     
      text: "Фишинговые атаки представляют собой постоянную угрозу – с использованием различной социальной инженерии.(ссылка внешняя)Используя уловки, киберпреступники попытаются обманом заставить вас раскрыть личную информацию, такую ​​как ваш логин и пароль, информацию о банковских операциях или кредитной карте. Фишинговое мошенничество может осуществляться по телефону, посредством текстовых сообщений или через сайты социальных сетей, но чаще всего по электронной почте. С подозрением относитесь к любому официальному электронному сообщению или телефонному звонку, в которых запрашивается личная или финансовая информация." 
    },
    {
      label: "Практикуйте хорошее управление паролями",
      path: "password.png",       
      text: "У всех нас слишком много паролей, которыми нужно управлять, и легко найти обходной путь, например, повторно использовать один и тот же пароль. Менеджер паролей может помочь вам поддерживать надежные уникальные пароли для всех ваших учетных записей. Эти программы могут генерировать для вас надежные пароли, автоматически вводить учетные данные и напоминать вам о необходимости периодического обновления паролей. Калифорнийский университет в Беркли предлагает бесплатный LastPass Premium(ссылка внешняя)всем пользователям с идентификатором CalNet."
    },
    {
      label: "Будьте осторожны с тем, что вы нажимаете.",
      path: "click.png",
      text: "Не посещайте неизвестные веб-сайты и не загружайте программное обеспечение из ненадежных источников. На этих сайтах часто размещаются вредоносные программы, которые автоматически устанавливаются (часто в автоматическом режиме) и ставят под угрозу ваш компьютер. Если вложения или ссылки в электронном письме по какой-либо причине кажутся неожиданными или подозрительными, не нажимайте на них. ISO рекомендует использовать Click-to-Play(ссылка внешняя)или NoScript(ссылка внешняя), дополнительные функции браузера, которые предотвращают автоматическую загрузку содержимого подключаемого модуля (например, Java, Flash) и сценарии, которые могут содержать вредоносный код."
    },
    {
      label: "Никогда не оставляйте устройства без присмотра",
      path: "left.png",
      text: "Физическая безопасность ваших устройств так же важна, как и их техническая безопасность. Если вам нужно оставить свой ноутбук, телефон или планшет на какое-то время — заприте его, чтобы никто другой не смог им воспользоваться. Если вы храните защищенные данные на флэш-накопителе или внешнем жестком диске, убедитесь, что они также зашифрованы и заблокированы. На настольных компьютерах заблокируйте экран или выключите систему, когда она не используется.      "
    },{
      label: " Используйте мобильные устройства безопасно",
      path: "phone.png",
      text: "Учитывая, насколько мы полагаемся на наши мобильные устройства и насколько они подвержены атакам, вам необходимо убедиться, что вы защищены: Заблокируйте свое устройство с помощью PIN-кода или пароля и никогда не оставляйте его незащищенным в общественных местах. Устанавливайте приложения только из надежных источников (Apple AppStore, Google Play). Постоянно обновляйте операционную систему устройства. Не нажимайте на ссылки или вложения в нежелательных электронных письмах или текстовых сообщениях. Избегайте передачи или хранения личной информации на устройстве. Большинство портативных устройств поддерживают шифрование данных. Доступные варианты можно найти в документации вашего устройства. Используйте Apple « Найти мой iPhone»(ссылка внешняя)или диспетчер устройств Android(ссылка внешняя)инструменты, помогающие предотвратить потерю или кражу.      "
    },
    {
      label: "Защитите защищенные данные.",
      path: "confidential.png",
      text: "Помните о защищенных данных, с которыми вы контактируете, и связанных с ними ограничениях. Ознакомьтесь со Стандартом классификации данных UCB, чтобы понять требования к уровню защиты данных. В общем: Храните защищенные данные высокого уровня (например, SSN, информацию о кредитных картах, студенческие записи, медицинскую информацию и т. д.) на своей рабочей станции, ноутбуке или мобильных устройствах. Безопасно удаляйте конфиденциальные файлы данных из вашей системы, когда они больше не нужны. Всегда используйте шифрование при хранении или передаче конфиденциальных данных."
    },
    {
      label: "Установите антивирусную защиту от вредоносных программ.",
      path: "antivirus.png",
      text: "Устанавливайте эти программы только из известного и надежного источника. Поддерживайте актуальность определений вирусов, механизмов и программного обеспечения, чтобы ваши программы оставались эффективными. Дополнительную информацию см. в наших рекомендациях по минимальным стандартам безопасности для защиты от вредоносного ПО.      "
    },{
      label: "Создайте резервную копию своих данных.",
      path: "backup.png",
      text: "Регулярно создавайте резервные копии — если вы стали жертвой инцидента безопасности, единственный гарантированный способ восстановить ваш компьютер — стереть и переустановить систему.      "
    },
  ];


export const hashMethods = [
    {
      id: "recents",
      label: "Recents",
    },
    {
      id: "home",
      label: "Home",
    },
    {
      id: "applications",
      label: "Applications",
    },
    {
      id: "desktop",
      label: "Desktop",
    },
    {
      id: "downloads",
      label: "Downloads",
    },
    {
      id: "documents",
      label: "Documents",
    },
  ]
 export const englishLettersAndDigits = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9'];